import os

from dotenv import load_dotenv

load_dotenv()

PROJECT_NAME = "murbot"
BOT_TOKEN = os.getenv("BOT_TOKEN")
CARD_NUMBER = os.getenv("CARD_NUMBER")
BTC = os.getenv("BTC")
LTC = os.getenv("LTC")
WEBSITE = os.getenv("WEBSITE")
OPERATOR = os.getenv("OPERATOR")
SUPPORT = os.getenv("SUPPORT")
REVIEWS = os.getenv("REVIEWS")
WORK = os.getenv("WORK")



CITIES = ["🌆Иркутск🌆", "🌆Шелехов🌆", "🌆Ангарск🌆", "🌆Усолье-Сибирское🌆", "🌆Братск🌆", "🌆Усть-кут🌆", "🌆Черемхово🌆", "🌆Усть-Илимск🌆", "🌆Тулун🌆", "🌆Нижнеудинск🌆", "🌆Тайшет🌆", "🌆Железногорск-Илимский🌆", "🌆Зима🌆", 
"🌆Вихоревка🌆", "🌆Саянск🌆", "🌆Северобайкальск🌆", "🌆Усть-Ордынский🌆", "🌆Магистральный🌆", "🌆Хомутово🌆", "🌆Слюдянка🌆", "🌆Листвянка🌆", "🌆Байкальск🌆", "🌆Урик🌆", "🌆Мегет🌆", "🌆Чунский🌆", "🌆Киренск🌆", "🌆Большой Луг🌆", 
"🌆Култук🌆", "🌆Свирск🌆", "🌆Баяндай🌆", "🌆Еланцы🌆", "🌆Большая Речка🌆", "🌆Новая Игирма🌆", "🌆Бохан🌆", "🌆Бирюсинск🌆", "🌆Алзамай🌆", "🌆Утулик🌆", "🌆Залари🌆", "🌆Кутулик🌆", "🌆Карлук🌆", "🌆Качуг🌆", "🌆Жигалагово🌆", "🌄Мальта🌄"]

PRODUCTS = [
    # 🌆Иркутск🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["☀️Солнечный☀️", "🏠Иркутск-2🏠", "🌟Молодёжный🌟", "🛸Новоленино🛸", "🏡Омулевского🏡", "🌝Первомайский🌝", "🍻Пивовариха🍻", "🚢Правобережный🚢", "🏭Танк🏭", "🏛Центр🏛"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️1г ": {"price": 3600,"regions": ["🌃Бульвар-Постышева🌃", "🏭Танк🏭"],},
        "💎КРИСТАЛ ФИОЛЕТОВЫЙ💜0,75г ": {"price": 3100,"regions": ["🌁Маркова🌁", "🏡Омулевского🏡"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["❄️Берёзовый❄️", "🏘Академгородок🏘", "🛤ЖД-Вокзал🛤", "🏠Ивату🏠", "🏣Кая🏣", "🗻Лисиха🗻", "🛸Новоленино🛸", "🏡Омулевского🏡", "🏡Синюшина🏡", "🚏Якоби🚏"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚1г ": {"price": 3600,"regions": ["⭐️Юбилейный⭐️", "🏘Академгородок🏘", "🛤ЖД-Вокзал🛤", "🗻Лисиха🗻", "🛸Новоленино🛸", "🌝Первомайский🌝", "🍻Пивовариха🍻"],},
        "💎КРИСТАЛ ЗЕЛЕНЫЙ🟢0,75гр ": {"price": 3100,"regions": ["🏭Танк🏭", "🏛Центр🏛",],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶075г ": {"price": 3100,"regions": ["🛤ЖД-Вокзал🛤", "🏜Жилкино🏜", "🚢Правобережный🚢"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶1г ": {"price": 3600,"regions": ["🏡Омулевского🏡", "🏭Танк🏭"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶2Г ": {"price": 6000,"regions": ["☀️Солнечный☀️", "🌃Бульвар-Постышева🌃", "🏠Ивату🏠", "🗻Лисиха🗻", "🏭Танк🏭", "🏛Центр🏛"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["☀️Солнечный☀️", "❄️Берёзовый❄️", "⭐️Юбилейный⭐️", "🏘Академгородок🏘", "🌃Бульвар-Постышева🌃","🛤ЖД-Вокзал🛤", "🏠Иркутск-2🏠", "🏣Кая🏣", "🗻Лисиха🗻", "🌁Маркова🌁",
        "🛸Новоленино🛸", "🏡Омулевского🏡", "🌝Первомайский🌝", "🍻Пивовариха🍻", "🚢Правобережный🚢", "🏭Танк🏭", "🏛Центр🏛", "🚏Якоби🚏"],},
        "💊MDMA 6ix 9ine🌈1шт ": {"price": 3100,"regions": ["🏠Иркутск-2🏠"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["☀️Солнечный☀️", "🌃Бульвар-Постышева🌃","🛤ЖД-Вокзал🛤", "🏜Жилкино🏜", "🏠Ивату🏠", "🗻Лисиха🗻", "🛸Новоленино🛸", "🚢Правобережный🚢", "🏛Центр🏛"],},
        "💊MDMA MASERATI🚘2шт ": {"price": 6000,"regions": ["🛸Новоленино🛸"],},
        "💎КРИСТАЛ ЧЁРНЫЙ🖤0.75гр ": {"price": 3100,"regions": ["🏠Иркутск-2🏠", "🛸Новоленино🛸",],},
        "☘️ШИШКИ LEMON HAZE 1гр🍋 ": {"price": 4100,"regions": ["🗻Лисиха🗻", "🚢Правобережный🚢"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️ 2г": {"price": 6000,"regions": ["🌃Бульвар-Постышева🌃", "🛸Новоленино🛸", "🍻Пивовариха🍻", "🏭Танк🏭", "🏛Центр🏛"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["⭐️Юбилейный⭐️", "🏘Академгородок🏘", "🌃Бульвар-Постышева🌃","🏜Жилкино🏜", "🗻Лисиха🗻", "🌁Маркова🌁", "🛸Новоленино🛸", "🏡Омулевского🏡", "🌝Первомайский🌝", 
        "🚢Правобережный🚢", "🏔Синюшина🏔", "🏭Танк🏭", "🏛Центр🏛"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚1.5г ": {"price": 4500,"regions": ["🌃Бульвар-Постышева🌃", "🏠Иркутск-2🏠", "🛸Новоленино🛸", "🏡Омулевского🏡", "🏭Танк🏭"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚2г ": {"price": 6000,"regions": ["🏡Омулевского🏡", "🏭Танк🏭"],},
        "💎КРИСТАЛ ФИОЛЕТОВЫЙ💜1,5г ": {"price": 4100,"regions": ["🏡Омулевского🏡"],},
        "🖤КРИСТАЛ ЧЁРНЫЙ⬛️1,5гр ": {"price": 4500,"regions": ["🚢Правобережный🚢",],},
        "☘️ШИШКИ LEMON HAZE 0.5гр🍋 ": {"price": 2200,"regions": ["🏠Иркутск-2🏠", "🌝Первомайский🌝", "🏡Синюшина🏡"],},
    },

    # 🌆Шелехов🌆
    { 
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🏙Шелехов🏙"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏙Шелехов🏙"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🏙Шелехов🏙"],},
    },

    # 🌆Ангарск🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["🏯Кварталы🏯"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🛕Южный Массив🛕"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["⛺️СНТ⛺️", "⭐️Центр⭐️", "🏯Кварталы🏯", "🏖Микры🏖"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["🛕Южный Массив🛕"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["⭐️Центр⭐️"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["⭐️Центр⭐️"],},
        "⚪️АМФЕТАМИН 0.5гр🤍 ": {"price": 1500,"regions": ["🛕Южный Массив🛕"],},
    },


    # 🌆Усолье-Сибирское🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["❄️🧂Усолье🧂❄️"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["❄️🧂Усолье🧂❄️"],},
    },

    # 🌆Братск🌆
    {
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["⚡️💫Энергетик💫⚡️", "🧭Правобережный🧭", "🏢Падун🏢", "🛕Центр🛕"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["⚡️💫Энергетик💫⚡️"],},
        "🧂СОЛЬ МУКА🟢1г ": {"price": 3100,"regions": ["⚡️💫Энергетик💫⚡️", "🏢Падун🏢", "🛕Центр🛕"],},
    },

    # 🌆Усть-кут🌆
    {
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🛢Нефтебаза", "🏛Старый Город🏛"],},
        "🧂СОЛЬ МУКА🟢1г ": {"price": 4400,"regions": ["🌆Закута🌆"],},
    },

    # 🌆Черемхово🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["🕋Черемхово🕋"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🕋Черемхово🕋"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🕋Черемхово🕋"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚1.5г ": {"price": 4500,"regions": ["🕋Черемхово🕋"],},
    },

    # 🌆Усть-Илимск🌆
    {
        "💎КРИСТАЛ БЕЛЫЙ⚪️1гр ": {"price": 4900,"regions": ["🏫Старый Город🏫"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶1г ": {"price": 4900,"regions": ["🏯Новый Город🏯", "🏫Старый Город🏫"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🏯Новый Город🏯"],},
        "💊MDMA 6ix 9ine🌈1шт ": {"price": 3100,"regions": ["🏯Новый Город🏯"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🕍Усть-Илимск🕍"],},
    },

    # 🌆Тулун🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🛕Тулун🛕"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🛕Тулун🛕"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["🛕Тулун🛕"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🛕Тулун🛕"],},
        "💊MDMA MASERATI🚘2шт ": {"price": 6000,"regions": ["🛕Тулун🛕"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🛕Тулун🛕"],},
        "🍪МЕФ НЕСКВИК🍪КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🛕Тулун🛕"],},
    },

    # 🌆Нижнеудинск🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🕌Нижнеудинск🕌"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🕌Нижнеудинск🕌"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["🕌Нижнеудинск🕌"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🕌Нижнеудинск🕌"],},
        "🍪МЕФ НЕСКВИК🍪КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🕌Нижнеудинск🕌"],},
    },

    # 🌆Тайшет🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🌇Тайшет🌇"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🌇Тайшет🌇"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🌇Тайшет🌇"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Тайшет🌇"],},
    },

    # 🌆Железногорск-Илимский🌆
    {
        "💎КРИСТАЛ БЕЛЫЙ⚪️1гр ": {"price": 4900,"regions": ["🏙Город🏙"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🏙Город🏙"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏙Город🏙"],},
    },

    # 🌆Зима🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🌆Город🌆"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🌆Город🌆"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["🌆Город🌆"],},
        "💊MDMA MASERATI🚘2шт ": {"price": 6000,"regions": ["🌆Город🌆"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌆Город🌆"],},
        "🍪МЕФ НЕСКВИК🍪КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🌆Город🌆"],},
    },

    # 🌆Вихоревка🌆
    {
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🏫Город🏫"],},
        "💊MDMA 6ix 9ine🌈1шт ": {"price": 3100,"regions": ["🏫Город🏫"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏫Город🏫"],},
        "🍪МЕФ НЕСКВИК🍪КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🏫Город🏫"],},
        "🧂СОЛЬ МУКА🟢1г ": {"price": 4400,"regions": ["🏫Город🏫"],},
    },

    # 🌆Саянск🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🏫Город🏫"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏫Город🏫"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["🏫Город🏫"],},
        "💊MDMA 6ix 9ine🌈1шт ": {"price": 3100,"regions": ["🏫Город🏫"],},
        "💊MDMA MASERATI🚘2шт ": {"price": 6000,"regions": ["🏫Город🏫"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏫Город🏫"],},
        "🍪МЕФ НЕСКВИК🍪КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🏫Город🏫"],},
    },

    # 🌆Северобайкальск🌆
    {
        "💎КРИСТАЛ БЕЛЫЙ⚪️1гр ": {"price": 4900,"regions": ["🌇Город🌇"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Город🌇"],},
    },

    # 🌆Усть-Ордынский🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["🏛Город🏛"],},
        "💎КРИСТАЛ ФИОЛЕТОВЫЙ💜0,75г ": {"price": 3100,"regions": ["🏛Город🏛"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🏛Город🏛"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶075г ": {"price": 3100,"regions": ["🏛Город🏛"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏛Город🏛"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🏛Город🏛"],},
        "☘️ШИШКИ Cinderella Jack☘️ - 1гр": {"price": 4100,"regions": ["🏛Город🏛"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏛Город🏛"],},
        "💎КРИСТАЛ ЧЁРНЫЙ⚫️1г ": {"price": 3600,"regions": ["🏛Город🏛",],},
    },

    # 🌆Магистральный🌆
    {
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Город🌇"],},
    },

    # 🌆Хомутово🌆
    {
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["Город"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["Город"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["Город"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["Город"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["Город"],},
        "🍪МЕФ НЕСКВИК🍪КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["Город"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️ 2г": {"price": 6000,"regions": ["Город"],},
    },

    # 🌆Слюдянка🌆
    {
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚1г ": {"price": 3600,"regions": ["🏛Город🏛"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏛Город🏛"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏛Город🏛"],},
        "💎КРИСТАЛ ЧЁРНЫЙ⚫️0.75г ": {"price": 3100,"regions": ["🏛Город🏛",],},
    },

    # 🌆Листвянка🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["🏞Город🏞"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏞Город🏞"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["🏞Город🏞"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🏞Город🏞"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏞Город🏞"],},
        "🍪МЕФ НЕСКВИК🍪КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🏞Город🏞"],},
    },

    # 🌆Байкальск🌆
    {
        "💎КРИСТАЛ БЕЛЫЙ⚪️1гр ": {"price": 3600,"regions": ["🏫Город🏫"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️1г ": {"price": 3600,"regions": ["🏫Город🏫"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3600,"regions": ["🏫Город🏫"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶075г ": {"price": 3100,"regions": ["🏫Город🏫"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏫Город🏫"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏫Город🏫"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️ 2г": {"price": 6000,"regions": ["🏫Город🏫"],},
    },

    # 🌆Урик🌆
    {
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🌆Город🌆"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🌆Город🌆"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🌆Город🌆"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌆Город🌆"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️ 2г": {"price": 6000,"regions": ["🌆Город🌆"],},
        "☘️ШИШКИ LEMON HAZE 0.5гр🍋 ": {"price": 2200,"regions": ["🌆Город🌆"],},
    },

    # 🌆Мегет🌆
    {
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🏫Город🏫"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏫Город🏫"],},
    },

    # 🌆Чунский🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🏔Город🏔"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🏔Город🏔"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏔Город🏔"],},
    },

    # 🌆Киренск🌆
    {
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌆Город🌆"],},
    },

    # 🌆Большой Луг🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️ 1.5г": {"price": 4500,"regions": ["🌇Большой Луг🌇"],},
        "💎КРИСТАЛ ЗЕЛЕНЫЙ🟢0,75гр ": {"price": 3100,"regions": ["🌇Большой Луг🌇",],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🌇Большой Луг🌇"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Большой Луг🌇"],},
    },

    # 🌆Култук🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️1г ": {"price": 3600,"regions": ["🏙Город🏙"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏙Город🏙"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🏙Город🏙"],},
    },

    # 🌆Свирск🌆
    {
        "💎КРИСТАЛ ЗЕЛЕНЫЙ🟢0,75гр ": {"price": 3100,"regions": ["🌇Свирск🌇",],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🌇Свирск🌇"],},
    },

    # 🌆Баяндай🌆
    {
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🌇Баяндай🌇"],},
        "💎КРИСТАЛ ЗЕЛЕНЫЙ🟢0,75гр ": {"price": 3100,"regions": ["🌇Баяндай🌇",],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🌇Баяндай🌇"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Баяндай🌇"],},
    },

    # 🌆Еланцы🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "💎КРИСТАЛ ФИОЛЕТОВЫЙ💜0,75г ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🌇Город🌇"],},
        "🍚МЕФ МЯУ🍚(1Г)": {"price": 4900,"regions": ["🌇Город🌇"],},
        "💊MDMA 6ix 9ine🌈1шт ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Город🌇"],},
    },

    # 🌆Большая Речка🌆
    {
        "💎КРИСТАЛ СИНИЙ🔵1.5гр ": {"price": 4500,"regions": ["💦Город💦"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["💦Город💦"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["💦Город💦"],},
        "☘️Гашиш - Сhocolate Haze🍫1г ": {"price": 3700,"regions": ["💦Город💦"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["💦Город💦"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["💦Город💦"],},
    },

    # 🌆Новая Игирма🌆
    {
        "💎КРИСТАЛ БЕЛЫЙ⚪️1гр ": {"price": 4900,"regions": ["🌇Город🌇"],},
        "💎КРИСТАЛ БЕЛЫЙ⚪️2гр ": {"price": 8800,"regions": ["🌇Город🌇"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["🌇Город🌇"],},
        "💊MDMA 6ix 9ine🌈1шт ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Город🌇"],},
    },

    # 🌆Бохан🌆
    {
        "💎КРИСТАЛ ФИОЛЕТОВЫЙ💜0,75г ": {"price": 3100,"regions": ["🏫Город🏫"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🏫Город🏫"],},
        "💎КРИСТАЛ ЧЁРНЫЙ⚫️0.75г ": {"price": 3100,"regions": ["🏫Город🏫",],},
    },

    # 🌆Бирюсинск🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🌇Город🌇"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🌇Город🌇"],},
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🌇Город🌇"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🌇Город🌇"],},
    },

    # 🌆Алзамай🌆
    {
        "🧂СОЛЬ МУКА БЕЛАЯ⚪️1гр ": {"price": 3100,"regions": ["🏙Город🏙"],},
        "🍚МЕФ МЯУ🍚(1Г)": {"price": 4900,"regions": ["🏙Город🏙"],},
        "💊MDMA MASERATI🚘1шт ": {"price": 3100,"regions": ["🏙Город🏙"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🏙Город🏙"],},
    },

    # 🌆Утулик🌆
    {
        "💼Работа Курьером💼 ": {"price": 8000,"regions": ["🕌Город🕌"],},
    },

    # 🌆Залари🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["🏠Город🏠"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["🏠Город🏠"],},
    },

    # 🌆Кутулик🌆
    {
        "💎КРИСТАЛ КРАСНЫЙ❤️0,75г ": {"price": 3100,"regions": ["☘️Город☘️"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶075г ": {"price": 3100,"regions": ["☘️Город☘️"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶1г ": {"price": 3600,"regions": ["☘️Город☘️"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["☘️Город☘️"],},
    },

    # 🌆Карлук🌆
    {
        "💎КРИСТАЛ ИЗУМРУДНЫЙ💚0,75г ": {"price": 3100,"regions": ["🌆Город🌆"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["🌆Город🌆"],},
    },

    # 🌆Качуг🌆
    {
        "💎КРИСТАЛ ЗЕЛЕНЫЙ🟢0,75гр ": {"price": 3800,"regions": ["Качуг",],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶1г ": {"price": 4900,"regions": ["Качуг"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 5100,"regions": ["Качуг"],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["Качуг"],},
        "🔶КРИСТАЛ ЯНТАРНЫЙ🔶1.5г ": {"price": 5800,"regions": ["Качуг"],},
        "💎КРИСТАЛ КРАСНЫЙ❤️ 2г": {"price": 8600,"regions": ["Качуг"],},
    },

    # 🌆Жигалагово🌆
    {
        "💎КРИСТАЛ ЗЕЛЕНЫЙ🟢0,75гр ": {"price": 3800,"regions": ["Жигалагово",],},
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎2г ": {"price": 8900,"regions": ["Жигалагово"],},
    },

    # 🌄Мальта🌄
    {
        "🍪МЕФ НЕСКВИК🍪 КРИСТАЛ 🤎1г ": {"price": 4900,"regions": ["Белореченск", "Мальта"],},
    },
]

# list(PRODUCTS[0].keys())[0]

# print(PRODUCTS[0]["💎Мефедрон (кристал белоснежный)15г(58400руб.)"]["regions"])

# 🌆Култук🌆", "🌆Свирск🌆", "🌆Баяндай🌆", "🌆Еланцы🌆", "🌆Большая Речка🌆", "🌆Новая Игирма🌆", "🌆Бохан🌆", "🌆Бирюсинск🌆", "🌆Алзамай🌆", "🌆Утулик🌆", "🌆Залари🌆", "🌆Кутулик🌆", "🌆Карлук🌆", "🌆Качуг🌆", "🌆Жигалагово🌆", "🌄Мальта🌄                       
# ❤️💜💚🤎☘️🖤🟢⚫️⬛️🟡🔶💊🍋🚘🍪🌈🧲💼||||||||||||||||||||||||| 🏘🏭🌟🌝☀️🚢🌃🌁🏛🏡🛤 🏜🗻🏣🏠🚏🛸❄️⭐️🏔 🍫⚪️