import os

from dotenv import load_dotenv

load_dotenv()

PROJECT_NAME = "murbot"
BOT_TOKEN = os.getenv("BOT_TOKEN")
CARD_NUMBER = os.getenv("CARD_NUMBER")
SUPPORT = os.getenv("SUPPORT")
BTC = os.getenv("BTC")
LTC = os.getenv("LTC")

CITIES = ["Ⓜ️осква", "Санкт-Петербург", "Люберцы", "Балашиха", "Сестроецк", "Колпино", "Пушкин(СПБ)", "Тосно", "Гатчина", "Петергоф", "Химки", 
"Подольск", "Красное село", "Мытищи", "Королев", "Одинцово", "Сосновый бор(СПБ)", "Всеволжск", "Сертолово", "Выборг", "Псков", "Кудрово", "Зеленогорск", "Домодедово", "Троицк", "Тямша", "Сходня", "Чехов", "г.Красногорск", "Зеленоград", "Щелково"]

PRODUCTS = [
    # Ⓜ️осква
    {
        "🔸Альфа ПВП Кристалл Янтарный 1г🔸": {"price": 3150,"regions": ["ЗАО, м.Крылатское", "СЗАО, м.Строгино", "ЗАО, м.Митино", "САО, м.Полежаевская", "СЗАО Октябрьское поле"]},
        "🔸Альфа ПВП Кристалл Янтарный 0.5г🔸": {"price": 2550,"regions": ["ЗАО, м.Молодежная"]},
        "💎Альфа ПВП Кристалл Белый 0.5г💎": {"price": 2650,"regions": ["ВАО, Лефортово", "ЗАО, м.Парк Победы", "ЗАО, Пятницкое шоссе", "СЗАО, м.Сходненская", "ЮВАО м.Юго-Восточная", "ЮЗАО, м.Бунинская Алея", "ЮЗАО м.Коньково", "ЮЗАО м.Скоболевская", 
"ВАО Бульвар Рокоссовкого", "ЗАО Раменки", "ЗАО м.Митино", "ЗАО м.Проспект Вернадского", "м.Бутово", "САО м.Полежаевская", "СВАО, м.ВДНХ", "ЮАО м.Зябликово", "ЮВАО Авиамоторная", "ЮВАО м.Котелькини", "ЮЗАО м.Зюзино", "ЮЗАО м.Ясеново"]},

        "💎Альфа ПВП Кристалл Белый 1г💎": {"price": 3250,"regions": ["ВАО, м.Электрозаводская", "ЗАО, м.Крылатское", "ЗАО м.Филевский Парк", "СВАО м.Коптево", "СВАО м.Марьина роща", "ЮЗАО м.Тропарева", "ЮЗАО м.Румянцево", "ЮЗАО, Ольховая", 
"ВАО м.Партизанская", "ВАО, Преображенская Площадь", "ЗАО м.Очаково", "Лисоноостровский р-н (ЖД станция ЛОСЬ)", "САО Аэропорт", "САО Войковская", "САО Речной Вокзал", "САО Селигерская", "САО Фонвизинская", "САО м.Полежаевская", "САО м.Тимирязевская", 
"СВАО Медведково", "СВАО м.Бибирево", "СЗАО м.Народное Ополочение", "СЗАО м.Беговая", "СЗАО м.Щукинская", "ЮАО Красногвардейская", "ЮАО Кантемировская", "ЮЗАО м.Солнцево"]},

        "💙Альфа ПВП Кристалл Синий 1💙": {"price": 3150,"regions": ["ЗАО м.Пакр Победы", "СВАО м.Бибирево"]},
        "💚Альфа ПВП Кристалл Зелёный 1г💚": {"price": 3150,"regions": ["САО, м.Петровско-Разумовская", "ВАО м.Шоссе Энтузиастов", "ЗАО, м.Минская", "САО Речной вокзал", "САО м.Водный стадиион", "ЮЗАО м.Новаторская"]},
        "💚Альфа ПВП Кристалл Зелёный 0.5г💚": {"price": 2550,"regions": ["ЮЗАО, м.Коньково", "ЮЗАО, Ольховая", "ЮВАО Печатники", "ЮЗАО м.Беляево", "ЮЗАО м.Калужская", "ЮЗАО м.Улица Старокачаловская"]},
        "❤️Альфа ПВП Кристалл Красный 0.5г❤️": {"price": 3150,"regions": ["СВАО Медведково"]},    
        "☁️Альфа-мука 0.5г☁️": {"price": 2450,"regions": ["ЮВАО, м Стахановская"],},
        "☁️Альфа-мука 1г☁️": {"price": 2950,"regions": ["СЗАО, м.Строгино"],},
        "😻Меф кристаллический VHQ 1г😻": {"price": 3499,"regions": ["ЗАО Новопеределкино", "ЮАО м.Борисово", "ВАО Бульвар Рокоссовского", "ВАО м.Партизанская", "Вао м.Перово", "ЮАО Красногвардейская", "ЮАО Алмата-Атинская", "ЮАО м.Зябликово", 
"ЮАО Авиамоторная", "ЮЗАО м.Прокшино", "ЮЗАО м.Филатов-Луг", "ЮЗАО м.Ясенево", "ЮЗАО м.Лесопарковая"],}, 
        "⚜️😻Меф KARAT V.H.Q 1гр😻⚜️": {"price": 3399,"regions": ["ВАО, м.Комсомольская", "ВАО, м.Красносельская"],}, 
        "😺Меф SNOW VHQ 1гр😺": {"price": 3399,"regions": ["ВАО м.Электрозаводская", "ЗАО м.Пятницкое Шоссе","САО м.Сокол", "САО м.Коптево", "САО, м.Петровско-Разумовская", "СВАО м.Марньина Роща", "ЮАО м.Нагатинская", "ЮВАО м.Братиславская", "ЮЗАО  м.Румиянцево",
"ЮЗАО м.Профсоюзная", "ЮЗАО м.Рассказовка", "ВАО м.Партизанская", "ВАО, м.Черковская", "ЗАО м.Саларьево", "ЗАО м.Волоколамская", "ЗАО м.Славянский Бульвар", "САО, м.Ховрино", "СЗАО м.Планёрная", "ЮАО Алма-Атинская", "ЮАО, м.Аннино", "ЮАО м.Кантемировская", 
"ЮАО м.Царицыно", "ЮВАО Нижнегородская", "ЮВАО м.Волжская", "ЮВАО м.Авиамоторная", "ЮВАО м.Некрасовка", "ЮЗАО Академическая", "ЮЗАО Солнцево", "ЮЗАО Бульвар Дмитрия Донского", "ЮЗАО Севастопольская"],}, 
        "😺Меф SNOW VHQ 2гр😺": {"price": 6399,"regions": ["ЗАО м.Юго-Западная", "ЮВАО м.Стахоновская", "ЮЗАО м.Зюзино"],},

        "💠😻Мефедрон EMPORIO VHQ 1г😻💠": {"price": 3399,"regions": ["ВАО, м.Электрозаводская", "ЗАО, Пятницкое шоссе", "САО м.Сокол", "СВАО м.Коптево", "САО, м.Петровско-Разумовская", "СВАО м.Марньина Роща", "ЮАО м.Нагатинская", "ЮВАО м.Братиславская", "ЮЗАО  м.Румиянцево",
"ЮЗАО м.Профсоюзная", "ЮЗАО м.Рассказовка", "ВАО м.Партизанская", "ВАО, м.Черковская", "ЗАО м.Саларьево", "ЗАО м.Волоколамская", "ЗАО м.Славянский Бульвар", "САО, м.Ховрино", "СЗАО м.Планёрная", "ЮАО Алма-Атинская", "ЮАО, м.Аннино", "ЮАО м.Кантемировская", 
"ЮАО м.Царицыно", "ЮВАО Нижнегородская", "ЮВАО м.Волжская", "ЮВАО м.Авиамоторная", "ЮВАО м.Некрасовка", "ЮЗАО Академическая", "ЮЗАО Солнцево", "ЮЗАО Бульвар Дмитрия Донского", "ЮЗАО Севастопольская"],}, 
        "💠😻Мефедрон EMPORIO VHQ 2г😻💠": {"price": 6699,"regions": ["ВАО Бульвар Россовского", "ВАО м.Сокольники", "ВАО м.Партизанская", "ЮВАО м.Печаткин"],}, #
        "👟Амфетамин VHQ 1г👟": {"price": 2400,"regions": ["ЗАО м.Юго-Западная", "СЗАО м.Планёрная"]}, 
        "🌲Шишки Red Devil 1г👹": {"price": 2700,"regions": ["ЮЗА м.Крылатское","ЮЗАО м.Тропарева", "ЮЗАО м.Румянцево", "ЮЗАО м.Расказзовка", "ЗАО м.Давыдково", "ЗАО м.Саларьево", "ЗАО Митино", "ЗАО м.Юго-Западная", "ЮАО м.Кантемировская", "ЮАЗО Академическая",
"ЮЗАО м.Филатов Луг", "ЮЗАО м.Нахимовский Проспект"," ЮЗАО м.Солнцево", "ЮЗАО м.Бульвар Дмитрия Донского"]},
        "🎁АКЦИЯ!!!💎Альфа ПВП Кристалл Белый 1гр💎": {"price": 2699,"regions": ["ЗАО м.Крылатское", "ЗАО Покровская", "СЗАО м.Стрешнево"]},
        "🎁АКЦИЯ!!!☁️Альфа-мука 1гр☁️": {"price": 2350,"regions": ["СЗАО м.Планёрная"]},
        "🎁АКЦИЯ!!!🌲Шишки Red Devil 1гр👹": {"price": 2250,"regions": ["ЗАО м.Озёрная", "ЗАО м.Пятницоке Шоссе", "СЗАО м.Строгино", "ЮЗАО м.Бунинская Аллея", "ЮЗАО м.Рассказовска", "ЮЗАО м.Скоболевская", "ЗАО Раменки", "ЗАО, м.Волоколамская", "ЗАО м.Минская", 
"ЗАО м.Молодежная", "ЗАО м.Мякинино", "СЗАО м.Тушинская", "ЮАО Красногвардейская", "ЮАО м.Орехово", "ЮАО м.Алма-Атинская", "ЮАО м.Аннино", "ЮЗАО м.Зюзино", "ЮАЗО м.Прокшино", "ЮЗАО Новаторская"]},
        "🎁АКЦИЯ!!!☁️альфа-мука 1гр☁️": {"price": 1475,"regions": ["ЗАО м.Крылатское", "СЗАО м.Планёрная"]},
        "🎁АКЦИЯ!!!🌲шишки Red Devil 1гр👹": {"price": 1425,"regions": ["СЗАО м.Сходненская","ЗАО Волоколамская", "СЗАО м.Спартак", "СЗАО м.Планёрная"]},
        "🎁АКЦИЯ!!!💙Альфа ПВП Кристалл Синий 1гр💙": {"price": 2699,"regions": ["СЗАО м.Планёрная"]},
        "🎁АКЦИЯ!!!💎Альфа ПВП Кристалл Белый 0.5гр💎": {"price": 2050,"regions": ["ВАО Лефортово", "ЗАО м.Филевский Парк", "СЗАО м.Сходненская", "СЗАО м.Строгино", "ЗАО м.Пионерская", "ЗАО м.Багратионовская", "ЗАО м.Волоколамская", "ЗАО м.Митино", "ЗАО м.Молодёжная",
"ЗАО м.Мякинино", "СЗАО м.Спартак", "СЗАО м.Тушинская", "СЗАО м.Стрешнево", "СЗАО м.Щукинская"]},
        "🎁АКЦИЯ!!!👟Амфетамин VHQ 1гр👟": {"price": 1800,"regions": ["ЮЗАО м.Бунинская Аллея", "ЮЗАО м.Рассказовка", "ЮЗАО м.Скоболевская","ЮАО Аннино","ЮЗАО м.Новаторская", "ЮЗАО м.Новаторская", "ЮЗАО м.Улица Старокачаловская"]}, 
        "⚜️Ecstasy Maserati 2шт.⚜️": {"price": 2199,"regions": ["ЮЗАО м.Тёплый стан", "ЗАО Волоколамская", "СЗАО м.Спартак", "СЗАО м.Тушинская", "ЮАО м.Коммунарка"]}, 
        "🎁АКЦИЯ!!!🔸Альфа ПВП Кристалл Янтарный 1г🔸": {"price": 2699,"regions": ["СЗАО м.Спартак", "СЗАО м.Планёрная"]},
        "💎Альфа ПВП 2.0 Кристалл Белый 0.5гр💎": {"price": 2550,"regions": ["САО Селигерская"]},
        "❤️Альфа ПВП 2.0 Кристалл Красный 1гр❤️": {"price": 3050,"regions": ["САО м.Сокол", "СВАО м.Медведково", "СЗАО м.Сходненская", "САО м.Динамо", "СЗАО м.Полежаевская", "СЗАО м.Спартак", "СЗАО м.Спартак", "СЗАО м.Тушинская", "СЗАО м.Щукинская"]},
        "❤️Альфа ПВП 2.0 Кристалл Красный 0.5гр❤️": {"price": 2450,"regions": ["САО, м.Петровско-Разумовская", "ВАО м.Сокольники", "ВАО м.Щелковская"]},
        "💙Альфа ПВП 2.0 Кристалл Синий 1гр💙": {"price": 3050,"regions": ["СВАО Медведково", "ЮВАО Братиславская", "САО Селигерская", "СВАО м.Алтуфьево", "ЮВАО м.Улица Дмитриевского"]},
        "🎁АКЦИЯ!!!⚜️Ecstasy Maserati 2шт.⚜️": {"price": 1699,"regions": ["ЗАО, Пятницкое шоссе", "ЮЗАО м.Бунинская Аллея"]}, 
        "🎁АКЦИЯ!!!❤️Альфа ПВП Кристалл Красный 1г❤️": {"price": 2599,"regions": ["ЗАО м.Крылатское"]},
        "🎁АКЦИЯ!!!❤️Кристалл Красный 0.5г❤️": {"price": 1199,"regions": ["ЗАО Раменки"]},
        "🎁АКЦИЯ!!!❤️Альфа ПВП 2.0 Кристалл Красный 1г❤️": {"price": 2599,"regions": ["ЗАО м.Крылатское"]},
        "🎁АКЦИЯ!!!❤️Альфа ПВП 2.0 Кристалл Красный 0.5г❤️": {"price": 1850,"regions": ["ВАО м.Шоссе Энтузиастов", "ЗАО м.Волоколамская", "САО м.Балтийская", "СВАО Алексеевская", "СВАО м.Алтуфьево"]},
        "🎁АКЦИЯ!!!💚Альфа ПВП Кристалл Зелёный 1гр💚": {"price": 2550,"regions": ["ЗАО м.Парк Победы", "ЗАО м.Пятницкое Шоссе", "САО м.Сокол", "СЗАО м.Сходненская", "ЗАО Волоколамская", "СВАО м.Войковская", "СЗАО м.Планёрная"]},
        "🎁АКЦИЯ!!!💚Альфа ПВП Кристалл Зелёный 0.5гр💚": {"price": 1950,"regions": ["ЗАО м.Крылатское", "СЗАО м.Сходненская", "ЗАО м.Митино", "ЗАО м.Мякинино", "САО Полежаевская", "СЗАО м.Спартак", "СЗАО м.Октябрьское Поле"]},
        "🎁АКЦИЯ!!!💎Альфа ПВП 2.0 Кристалл Белый 1гр💎": {"price": 2550,"regions": ["СЗАО м.Спартак", "СЗАО м.Октябрьское Поле"]},
        "🍫😻Меф Chocolate 1гр😻🍫": {"price": 3399,"regions": ["САО, м.Петровско-Разумовская", "СЗАО м.Строгино", "ЗАО м.Мякинино", "САО Войковская", "ЮАО Марьино", "ЮЗАО М.Ясенево"],},
        "🎁АКЦИЯ!!!💎Альфа ПВП Кристалл Белый 0.5гр💎": {"price": 1325,"regions": ["ЗАО м.Крылатское", "ЗАО м.Волоколамская"]},
        "🎁АКЦИЯ!!!💎Альфа ПВП 2.0 Кристалл Белый 0.5гр💎": {"price": 1950,"regions": ["ВАО, м.Лефортово"]},
        "🍫💎Hash Ice-o-lator 1г💎🍫": {"price": 3399,"regions": ["ЮАО м.Южная", "юзао м.Скоболевская", "ЮАО м.Орехово", "ЮАО м.Кантемировская", "ЮАО м.Марьино", "ЮАО м.Царицыно", "ЮАО м.Шипиловская", "ЮВАО м.Авиамоторная", "ЮЗАО м.Академическая", "ЮЗАО м.Ясенево"],}, # ? ok
    },

    # Санкт-Петербург #!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ДОРОБИТИ
    { 
        "💎Мефедрон (кристал белоснежный)15г": {"price": 3250,"regions": ["Район"],},
        "💎Мефедрон (кристал белоснежный)10г": {"price": 6199,"regions": ["Район"],},
        "🌲Шишки Red Devil 1г👹": {"price": 2700,"regions": ["Район"],},
    },

    # Люберцы #*********************** ЗРОБЛЕНО
    {
        "💎Альфа ПВП Кристалл Белый 1г💎": {"price": 3250,"regions": ["Малаховка", "Ст.Удельная", "Центр"],},
        "💎Альфа ПВП Кристалл Белый 2г💎": {"price": 6199,"regions": ["Панки"],},
        "🌲Шишки Red Devil 1г👹": {"price": 2700,"regions": ["Красково", "Малаховка"],},
    },


    # Балашиха #*********************** ЗРОБЛЕНО
    {
        "🌲Шишки Red Devil 1г👹": {"price": 2700,"regions": ["Железнодорожный"],},
        "💼РАБОТА КУРЪЕРОМ💼": {"price": 5000,"regions": ["Центр"],},
    },

    # Сестрорецк #*********************** ЗРОБЛЕНО
    {
        "💎Кристалл Белый 1г💎": {"price": 3250,"regions": ["Сестрорецк"],},
    },

    # Колпино #!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ДОРОБИТИ
    {
        "💎Мефедрон (кристал белоснежный)10г": {"price": 40800,"regions": ["Район"],},
        "💎Мефедрон (кристал белоснежный)5г": {"price": 23200,"regions": ["Район"],},
        "💊ECSTASY™💊✲➡️LOVE IS⬅️✲5шт": {"price": 12000,"regions": ["Район"],},
        "🌲Бошки 5г🌲": {"price": 14000,"regions": ["Район"],},
        "🚀✲Амфетамин Premium✲5г🚀": {"price": 14500,"regions": ["Район"],},
        "🚀✲Амфетамин Premium✲3г🚀": {"price": 9500,"regions": ["Район"],},
        "🍫Гаш🍫5г": {"price": 14000,"regions": ["Район"],},
    },

    # Кизилюрт
    {
        "💎Мефедрон (кристал белоснежный)15г": {"price": 58500,"regions": ["Район"],},
        "🍫Гаш🍫5г": {"price": 14000,"regions": ["Район"],},
    },
]

# list(PRODUCTS[0].keys())[0]

# print(PRODUCTS[0]["💎Мефедрон (кристал белоснежный)15г(58400руб.)"]["regions"])